Revit 2027 API
Form.IsConnectingEdge Method
Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsConnectingEdge(
	Reference edgeReference
)
Public Function IsConnectingEdge (
	edgeReference As Reference
) As Boolean
public:
bool IsConnectingEdge(
	Reference^ edgeReference
)
member IsConnectingEdge :
        edgeReference : Reference -> bool
Parameters
edgeReference Reference
The reference of the edge to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace